RatesTheory.tex
% Created 2012-08-17 Fri 16:31
\documentclass[a4paper]{beamer}
\usepackage[utf8]{inputenc}
\usepackage{hyperref}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Rates Theory}
\author{Ivan Hanigan}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.11}}

\begin{document}

\maketitle

% Org-mode is exporting headings to 3 levels.
\hrule


\begin{frame}
\frametitle{Introduction to rates, standardisation and adjustment}
\label{sec-1}

\section{Introduction}
The aim of this project is to explore the methodological issues of rates, standardisation and adjustment in regression models.
This topic is relevant in epidemiology and demography (and most human sciences).

The demonstration will utilize the R package \emph{ProjectTemplate}.
\end{frame}
\begin{frame}
\frametitle{Theoretical background}
\label{sec-2}

Different age or sex structures of study populations can be the reason for important differences between the health outcomes of the populations that need to be accounted for when assessing other putative causal relationships such as socio-economic status or the physical environment. 

There are two common methods for age standardisation: direct and indirect. There is also an alternative method using Poisson models that adjust for age as a covariate.
\end{frame}
\begin{frame}
\frametitle{Compared to what?}
\label{sec-3}

Question: Hi Epidemiologist, how are you?

Epidemiologist: Compared to what?
\end{frame}
\begin{frame}
\frametitle{Standardisation strengths and weaknesses}
\label{sec-4}

The direct and indirect methods have a long history of use to control for age (and indeed other differences between populations such as sex and other stratifying variables).  However, the idea that indirect standardisation is based on the non-study population as the common standard is a misconception which results in a common methodological error: comparing indirectly age standardised incidence ratios (these can only really compare the study population to the standard population, not between study populations). 

While direct standardization does provide comparable measures it has other weaknesses, such as greater susceptibility than the indirect method to error with small numbers. Indirect incidence ratios can be compared if you make the assumption that the ratio of rates between the study and standard populations is constant; this is similar to the assumption of proportional hazards in Cox regression. 
\end{frame}
\begin{frame}
\frametitle{Adjustment in regression}
\label{sec-5}

The aim of standardisation is to control for a compositional variable. This, of course, is also one of the main aims of regression analysis. One could analyse the data using Poisson regression, a method appropriate for small numbers. An advantage of the regression approach is that one can easily control for multiple confounders. Also, we can test for the presence of an interaction, which would question the validity of the additive model underlying direct standardization. 
\end{frame}
\begin{frame}
\frametitle{init}
\label{sec-6}
\end{frame}
\begin{frame}
\frametitle{Additions}
\label{sec-7}
\end{frame}
\begin{frame}
\frametitle{Data}
\label{sec-8}

\section{Data}
\begin{itemize}

\item get the princeton tutorial\\
\label{sec-8-1}%
The website by German Rodriguez from Princeton is good \href{http://data.princeton.edu/eco572/std.html}{http://data.princeton.edu/eco572/std.html}
Has some data and methods, comparing with book Demography: measuring and modeling population processes? Samuel H. Preston, Patrick Heuveline, Michel Guillot - 2001.
get data from \href{http://data.princeton.edu/eco572/datasets/preston21long.dat}{http://data.princeton.edu/eco572/datasets/preston21long.dat}
on 13-4-12



\item get the stata tutorial\\
\label{sec-8-2}%
We will use data borrowed from Kahn and Sempos (1989, 95-105) that are available on the Stata website, and in the datasets and do-files subdirectory.  The problem is (Stata 9, Ref A-J, p. 310), We want to compare 1970 mortality rates in California and Maine, adjusting for age.  Although we have age-specific population counts for the two states, we lack age-specific death rates.  In this situation, direct standardization is not feasible.  We can use the US population census data for the same year to produce indirectly standardized rates for the these two states.       
downloaded 13-4-12



\end{itemize} % ends low level
\end{frame}
\begin{frame}
\frametitle{Analysis}
\label{sec-9}

\section{Analysis}
\end{frame}
\begin{frame}
\frametitle{Direct standardisation}
\label{sec-10}
\end{frame}
\begin{frame}
\frametitle{Indirect standardisation}
\label{sec-11}
\end{frame}
\begin{frame}
\frametitle{Adjustment using regression}
\label{sec-12}
\end{frame}
\begin{frame}
\frametitle{Control for secular trend}
\label{sec-13}
\end{frame}
\begin{frame}
\frametitle{Uses in spatial epidemiology}
\label{sec-14}
\end{frame}
\begin{frame}
\frametitle{Indirect standardisation controlling for spatial correlation}
\label{sec-15}

We'll use the example of the Conditional Autoregressive (CAR) model of Lip cancer in Scotland.
\end{frame}
\begin{frame}
\frametitle{Regression approach to spatial rates}
\label{sec-16}

Mantel and Stark (1968), with reference to an alternative approach to indirect age standardisation. This is useful when the data are being internally standardised (using the data themselves as the standard) 
and where there is potential confounding. The general approach is to use a regression model with the variable to be standardised (eg age) and with the stratification variable which is potentially confounded (eg area). 
The standardised rates by the stratification variable can then be found from the regression predictions scaled to the observed total. Note that this approach requires non-zero cells for each stratum (eg at least one event per area).
\end{frame}
\begin{frame}
\frametitle{Weight by inverse of variance}
\label{sec-17}
\end{frame}
\begin{frame}
\frametitle{References}
\label{sec-18}
\end{frame}

\end{document}